Revit 2027 API
RoomTag.Room Property
The room that the tag is associated with.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Room Room { get; }
Public ReadOnly Property Room As Room
	Get
public:
property Room^ Room {
	Room^ get ();
}
member Room : Room with get
Property Value
Room
Remarks
In rare cases, the tag may not be associated to a room. The property will be null in these situations.
See Also
Reference
RoomTag Class
Autodesk.Revit.DB.Architecture Namespace